# Два метода в классе, один принимает в себя либо строку, либо число.
# Если передают строку, то смотрим: если произведение гласных и согласных букв меньше или
# равно длине слова, выводить все гласные, иначе согласные; если число то, произведение
# суммы чётных цифр на длину числа.
# Длину строки и числа искать во втором методе

class tr:
    def __init__(self):
        self.vvod()
    def func_1(self):
        return z*self.b
    def func_2(self.b):
        self.b = len(a)
    def vvod(self):
        self.a = input('введите: ')

tr()
if a.isdigit():
    func_2()
    z= 0
    for i in self.a:
        if i%2==0:
            z = z+i
elif a.isalpha():
    func_2()
    x =



